{
  "Башкы бет": "Главная",
  "Курс": "Курсы",
  "Окурмен": "О нас",
  "Отзыв": "Отзывы",


  "Азыркы замандын айтишниктери, келечектин аскерлери": "IT специалисты сегодня - солдаты будущего.",
  "Тесттен өтүп, биринчи сабакты акысыз көр": "Пройди тест и посмотри первый урок бесплатно",
  "Тесттен өтүү": "Пройти тест",
  "Биздин академияда программалоо багыттары:": "Направления программирования в нашей академии:",

  "Frontend англис тилинен тышкы интерфейс, backend - сервербөлүгү деп которулат. Frontend - системанын жүзү;Колдонуучуга сайт менен иштешүүгө мүмкүндүк берүүчү куралдаржана компоненттер.": "Изучение чтения изменит вашу жизнь. Фронтенд переводится с английского как внешний интерфейс, бэкенд - серверная часть. Фронтенд - лицо системы; инструменты и компоненты, которые позволяют пользователю взаимодействовать с сайтом. на русском.",
  "Backend (англ. back-end) - колдонуучудан жашырылган сайттынже тиркеменин толтурулушу. Backend - бул кызматтынпрограммалык жана аппараттык бөлүгү, ал браузерде жекомпьютерде эмес, серверде иштейт.": "Бэкенд обычно относится к серверной части веб-приложения, где происходит обработка, хранение и связь с интерфейсом (видимой частью веб-сайта). Он отвечает за обработку запросов со стороны клиента и предоставление соответствующих ответов.",
  "UX / UI веб-дизайн индустриясын үйрөнүү үчүн орто эсеп менен 5-8 ай талап кылынат. Жакшы адис болуу үчүн биринчи кезекте күчтүү каалоо, чыгармачылык, чыгармачылык, күчтүү фантазия болушу керек.": "Чтобы изучить индустрию веб-дизайна UX/UI, требуется в среднем 5-8 месяцев. Чтобы стать хорошим специалистом, прежде всего, нужно иметь сильное желание, креативность, креативность и сильное воображение.",

  "Биздин партнёрлор:": "Наши портнёры",
  "Бизге эң көп берилүүчү суроолор": "Часто задаваемые вопросы",

  "IT-ни окуу үчүн математика тили маанилүүбү?": "Важен ли математика для изучения IT?",
  "Жок": "Нет",
  "Англис тилин билбей туруп программоолону үйрөнсөк болобу?": "Можем ли мы изучать программирование, не зная английского языка?",
  "Ооба, болот. Англис тилин бизден бекер үйрөнөсүз.": "Да, это возможно. Вы можете бесплатно изучать английский язык у нас.",
  "Жаш чектөө барбы?": "Есть ли возрастное ограничение?",
  "9-жаштан 50 жашка чейин окууга болот": "Может быть прочитано в возрасте от 14 до 50 лет.",
  "Окуу борбор качан негизделген?": "Когда был основан образовательный центр?",
  "Окуу борбор 2022-жылдын Май айында негизделген.": "Центр обучения был основан в мае 2022 года.",
  "Окууну бүткөндөн кийин жумуш таап бересиздерби?": "Найдите работу после окончания учебы. Вы это сможете сделать?",
  "Эгерде сиз окууну жакшы өздөштүрүп, биз койгон талаптарга жооп берсеңиз, анда жумуш жагынан караштырып беребиз!": "Если вы хорошо учитесь и соответствуете нашим требованиям, мы рассмотрим вашу кандидатуру на работу!",
  "Сертификат берилеби?": "Будет ли выдан сертификат?",
  "Окууну ийгиликтүү бүткөндөн кийин окуу борбордон мамлекеттик деңгээлде диплом берилет.": "По успешному завершению обучения выдается диплом на государственном уровне из учебного центра.",

  "Акысыз сабакка жазылыңыз": "Запишитесь на бесплатный урок",
  "Шашыл! Акысыз мастер класска катталуу аяктайт": "Торопитесь! Запись на бесплатный урок закончится через",

  "Биздин дарек": "Наш адрес",

  "Биз менен бат жана сапаттуу билим ал!": "Получите быстрое и качественное образование вместе с нами!",
  "Кесипке ээ болууну каалагандар үчүн программалоо курстары, нөлдөн үйрөнүп, карьераңызда жаңы деңгээлге жетиңиз!": "Курсы программирования для карьеры, учитесь с нуля и поднимайте свою карьеру на новый уровень!",
  "Биздин баардык курстар": "Все наши курсы",
  "Сиз иштеп чыгуу менен алектенген жок болсо, негиздери менен баштоо керек: обьектиге-багытталган программалоо негиздери, Синтаксис, код дизайны жана маалымат базалары менен иштоо.": "Если вы не занимались разработкой, то стоит начать с основ: основ объектно-ориентированного программирования, синтаксиса, дизайна кода и работы с базами данных.",

  "CSS - бул каскаддык стилдер барагы. Бул тил форматы HTML элементи веб-сайтта кантип көрсөтүлүшү керектигин аныктайт интерфейс бетинде. HTML гипсокартон болсо, CSS болот бул боёк. HTML негизги структура болуп саналат да сиздин сайт, CSS сиздин сайтка баарын берет стили.": "CSS - это каскадные таблицы стилей. Этот язык разметки определяет, как HTML-элементы веб-сайта должны отображаться на интерфейсе страницы. Если HTML - это гипсокартон, CSS - это краска. В то время как HTML является основной структурой вашего сайта, CSS - это то, что дает всему вашему сайту стиль.",
  "мөөнөтү 9 ай": "срок длительносьти 9 месяц",
  "JavaScript программалоо тили интерактивдүү веб-сайттарды түзүү үчүн атайын ойлоп табылган.": "Язык программирования JavaScript придумали специально для того, чтобы создавать интерактивные сайты.",
  "React – бул Javascript программалоо тилинин популярдуу китепканасы, ал веб-колдонуучу интерфейстерин түзүү үчүн колдонулат.": "React – это популярная библиотека языка программирования Javascript, которая применяется для создания пользовательских web-интерфейсов",
  "Python динамикалык терүү жана таштанды чогултуу бар. Ал бир нече программалоо парадигмаларын колдойт, анын ичинде (өзгөчө процедуралык), объектиге багытталган жана функционалдык программалоо": "Python имеет динамическую типизацию и сборку мусора . Он поддерживает несколько парадигм программирования , включая (особенно процедурное ), объектно-ориентированное и функциональное программирование",
  "Django - бул тез өнүгүүгө жана таза, прагматикалык дизайнга өбөлгө түзгөн жогорку деңгээлдеги Python веб алкагы. Тажрыйбалуу иштеп чыгуучулар тарабынан түзүлгөн, ал веб-иштеп чыгуунун көп түйшүгүн талап кылат, андыктан сиз дөңгөлөктү кайра ойлоп таппай туруп, колдонмоңузду жазууга басым жасай аласыз. Бул бекер жана ачык булак.": "Django — это высокоуровневая веб-инфраструктура Python, которая способствует быстрой разработке и чистому  прагматичному дизайну. Созданный опытными разработчиками, он берет на себя большую часть хлопот веб-разработки, поэтому вы можете сосредоточиться на написании своего приложения, не изобретая велосипед. Это бесплатно и с открытым исходным кодом.",

  "Мугалимдер": "Преподаватели",
  "Тажрыйбалуу окутуучулар IT компанияларда иштеп чыгуучулар болуп иштешет": "Опытные учителя работают в IT-компаниях разработчиками",

  "ОКУРМЭН IT программалоо тилдерин үйрөтөт": "OKURMEN IT обучает языкам программирования",
  "Тажрыйбалуу мугалимдер жана  3 айлык практиканын жардамында сени жумушка  толук даярдайбыз!": "Имея опытных преподавателей и 3-месячную стажировку, мы полностью подготовим вас к работе!",
  "ОКУРМЭН - бул өнүктүрүүчү чөйрө!": "OKURMEN - это среда разработки!",
  "ОКУРМЭН окуу борбору - бул дүйнө жүзүндө актуалдуу болуп жактан IT тармагында билиим берүүчү академия. Биз Front-End, Back-End жана Flutter курстарын онлайн жана офлайн форматта окутабыз. Биздин максат - 2030 жылга чейин 100000 мыкты IT адистерин даярдоо жана КРны санариптештешкен мамлекеттердин катарына кошуу. Студенттерге сапатуу билим берүү менен мыкты кадр кылып даярдап, аларды максатына жеткирүү. Окурмэн окуу борбору 2022 - жылы май айында негизделген. Азыркы учурда командабызда 30дан ашуун киши эмгектенет. Кеңсебиз Бишкек шаарында жана дүйнө жүзү боюнча кыргыз тилинде билим алгысы келген студентер онлайн форматында окушат. Бүгүнкү күндө студенттерибиз окууну ийгиликтүү аяктап, IT адистери болуп иштей баштады.": "Центр обучения ОКУРМЕН - глобальный поставщик образовательных услуг в области IT-академии. Мы проводим онлайн и офлайн курсы по Front-End, Back-End и Flutter. Наша цель - подготовить 100 000 лучших IT-специалистов к 2030 году и включить КР в ряды цифровых стран. Предоставляя качественное образование студентам, мы готовим лучший персонал и помогаем им достичь своих целей. ОКУРМЕН был основан в мае 2022 года. На данный момент наша команда насчитывает более 30 сотрудников. Наш офис находится в городе Бишкек и предоставляет услуги на кыргызском языке для студентов со всего мира, которые хотят изучать в онлайн формате. Сегодня наши студенты успешно закончили обучение и начали работать в качестве IT-специалистов.",
  "Башкы негиздөөчү": "Главный основатель",
  "Директор орун басары": "Заместитель",
  "Директор жардамчысы": "Заместитель директора",
  "okurmen_kids Директору":"okurmen_kids Директор",
  "1 жылдан кийин азыркы чечимиңизге сөзсүз ыраазы болосуз!": "Через год вы поблагодарите себя за то, что начали сегодня!",
  "Кесипке ээ болууну каалагандар үчүн программалоо курстары нөлдөн баштап же карьераңызда жаңы деңгээлге жетиңиз": "Курсы программирования для начинающих профессионалов Начните с нуля или поднимите свою карьеру на новый уровень.",
  "Бишкектеги программалоо курсуна биздин сүйүктүү студенттерибиздин ой-пикирлери": "Мнения наших дорогих студентов о нас.",
  "Менторлор": "Менторы",
  "OKURMEN-KIDS бул 9-14 жаштагыларды IT тармагында билим берүүчү бөлүм. Сайттарды жана оюндары жасоо, дизайндар менен иштөөчү 3 айлык курстар!": "Okurmen Kids — это отделение, которое предоставляет ИТ-образование для детей в возрасте от 9 до 14 лет. Мы предлагаем 3-месячные курсы, посвященные разработке веб-сайтов и игр, а также работе с принципами дизайна!",
  "Отурум UX-дизайн чечимдери көбүнчө эстетикалык артыкчылык жана пикир эмес, изилдөө, маалыматтарды талдоо жана тесттин жыйынтыгы менен аныкталат.": "Решения сидячего UX-дизайна часто определяются исследованиями, анализом данных и результатами тестов, а не эстетическими предпочтениями и мнениями.",

  "жашта": "лет",
  "cаат": "время",
  "Жөнөтүү":"Отправить",
  "мүнөт":"минут",
  "секунд":"секунд",

  "Англис тил мугалими":"Учитель английского языка",
  "Иштеген компаниялары:": "Работающие компании:",
  "Иштеген жерлери:": "Места работы:",
  "жыл тыжрыйбасы": "года опыта",
  "Фрилансер болуп иштейт": "Работает фрилансером",
  "Фрилансер болуп иштейт Президенттик стипендиянын ээси 2021":"Работает фрилансером Обладатель президентской стипендии 2021 года.",
  "Сабакка жазылыңыз!": "Записаться на урок!",
  "Президенттик стипендиянын ээси 2021":"Студент, награжденный президентской стипендией 2021 года.",


  "Сиздин ишмердүүлүгүңүздүн чөйрөсү": "Ваша область деятельности",
  "Окуучу":"Школьник",
  "Ишкер":"Ишкер-----------------",
  "Мамлекеттик кызматкер":"Государственный служащий",
  "Сиздин жашыңыз":"Ваш возраст",
  "15-20 жаш":"15-20 лет",
  "21-30 жаш":"21-30 лет",
  "31-36 жаш":"31-36 лет",
  "36 жаштан жогору":"36 лет и старше",


  "Сиз буга чейин программалоону окудуңуз беле?":"Вы ранее изучали программирование?",
  "Ооба":"Да",


  "Азыр каяктасыз?":"Где вы сейчас?",
  "Атынызды калтырыныз":"Оставь свое имя",
  "Номеринизди калтырыныз":"Укажите свой номер телефона.",
  "СНГ 2022-жылдын эң мыкты студенти":"Лучший студент СНГ 2022 года"

}